bekencorp/armino/middleware/soc/bk7258/soc/sys_reg.h
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_TIM0_POS (20)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_TIM0_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_TIM1_POS (21)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_TIM1_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_TIM2_POS (22)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_TIM2_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_RESERVED_BIT_23_23_POS (23)
#define SYS_CPU_CLK_DIV_MODE1_RESERVED_BIT_23_23_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_I2S_POS (24)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_I2S_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_AUD_POS (25)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_AUD_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_JPEG_POS (26)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_JPEG_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_JPEG_POS (30)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_JPEG_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_DISP_L_POS (31)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_DISP_L_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_ADDR (SOC_SYS_REG_BASE + (0x9 << 2))

#define SYS_CPU_CLK_DIV_MODE2_CLKDIV_DISP_H_POS (0)
#define SYS_CPU_CLK_DIV_MODE2_CLKDIV_DISP_H_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_DISP_POS (3)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_DISP_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_PSRAM_POS (4)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_PSRAM_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_PSRAM_POS (5)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_PSRAM_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_QSPI0_POS (6)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_QSPI0_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE2_RESERVED_10_13_POS (10)
#define SYS_CPU_CLK_DIV_MODE2_RESERVED_10_13_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_SDIO_POS (14)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_SDIO_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SDIO_POS (17)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SDIO_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_AUXS_POS (18)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_AUXS_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_AUXS_POS (22)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_AUXS_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_FLASH_POS (24)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_FLASH_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_FLASH_POS (26)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_FLASH_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S0_POS (28)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S0_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE2_RESERVED_BIT_31_31_POS (31)
#define SYS_CPU_CLK_DIV_MODE2_RESERVED_BIT_31_31_MASK (0x1)

#define SYS_CPU_26M_WDT_CLK_DIV_ADDR (SOC_SYS_REG_BASE + (0xa << 2))

#define SYS_CPU_26M_WDT_CLK_DIV_CKDIV_26M_POS (0)
#define SYS_CPU_26M_WDT_CLK_DIV_CKDIV_26M_MASK (0x3)

#define SYS_CPU_26M_WDT_CLK_DIV_CKDIV_WDT_POS (2)
#define SYS_CPU_26M_WDT_CLK_DIV_CKDIV_WDT_MASK (0x3)

#define SYS_CPU_26M_WDT_CLK_DIV_CLKSEL_SPI0_POS (4)
#define SYS_CPU_26M_WDT_CLK_DIV_CLKSEL_SPI0_MASK (0x1)

#define SYS_CPU_26M_WDT_CLK_DIV_CLKSEL_SPI1_POS (5)
#define SYS_CPU_26M_WDT_CLK_DIV_CLKSEL_SPI1_MASK (0x1)

#define SYS_CPU_26M_WDT_CLK_DIV_RESERVED_BIT_6_31_POS (6)
#define SYS_CPU_26M_WDT_CLK_DIV_RESERVED_BIT_6_31_MASK (0x3ffffff)

#define SYS_CPU_ANASPI_FREQ_ADDR (SOC_SYS_REG_BASE + (0xb << 2))

#define SYS_CPU_ANASPI_FREQ_ANASPI_FREQ_POS (0)
#define SYS_CPU_ANASPI_FREQ_ANASPI_FREQ_MASK (0x3f)

#define SYS_CPU_ANASPI_FREQ_RESERVED_BIT_6_31_POS (6)
#define SYS_CPU_ANASPI_FREQ_RESERVED_BIT_6_31_MASK (0x3ffffff)

#define SYS_CPU_DEVICE_CLK_ENABLE_ADDR (SOC_SYS_REG_BASE + (0xc << 2))

#define SYS_CPU_DEVICE_CLK_ENABLE_I2C0_CKEN_POS (0)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2C0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI0_CKEN_POS (1)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART0_CKEN_POS (2)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PWM0_CKEN_POS (3)
#define SYS_CPU_DEVICE_CLK_ENABLE_PWM0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM0_CKEN_POS (4)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SADC_CKEN_POS (5)
#define SYS_CPU_DEVICE_CLK_ENABLE_SADC_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA_CKEN_POS (6)
#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_EFUSE_CKEN_POS (7)
#define SYS_CPU_DEVICE_CLK_ENABLE_EFUSE_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2C1_CKEN_POS (8)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2C1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI1_CKEN_POS (9)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART1_CKEN_POS (10)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART2_CKEN_POS (11)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PWM1_CKEN_POS (12)
#define SYS_CPU_DEVICE_CLK_ENABLE_PWM1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM1_CKEN_POS (13)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM2_CKEN_POS (14)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_OTP_CKEN_POS (15)
#define SYS_CPU_DEVICE_CLK_ENABLE_OTP_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2S_CKEN_POS (16)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2S_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_USB_CKEN_POS (17)
#define SYS_CPU_DEVICE_CLK_ENABLE_USB_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_CAN_CKEN_POS (18)
#define SYS_CPU_DEVICE_CLK_ENABLE_CAN_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PSRAM_CKEN_POS (19)
#define SYS_CPU_DEVICE_CLK_ENABLE_PSRAM_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI0_CKEN_POS (20)
#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI1_CKEN_POS (21)
#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SDIO_CKEN_POS (22)
#define SYS_CPU_DEVICE_CLK_ENABLE_SDIO_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_AUXS_CKEN_POS (23)
#define SYS_CPU_DEVICE_CLK_ENABLE_AUXS_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_BTDM_CKEN_POS (24)
#define SYS_CPU_DEVICE_CLK_ENABLE_BTDM_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_XVR_CKEN_POS (25)
#define SYS_CPU_DEVICE_CLK_ENABLE_XVR_CKEN_MASK (0x1)

