bekencorp/armino/middleware/soc/bk7258/soc/sys_reg.h
#define SYS_CPU_DEVICE_CLK_ENABLE_MAC_CKEN_POS (26)
#define SYS_CPU_DEVICE_CLK_ENABLE_MAC_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PHY_CKEN_POS (27)
#define SYS_CPU_DEVICE_CLK_ENABLE_PHY_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_JPEG_CKEN_POS (28)
#define SYS_CPU_DEVICE_CLK_ENABLE_JPEG_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_DISP_CKEN_POS (29)
#define SYS_CPU_DEVICE_CLK_ENABLE_DISP_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_AUD_CKEN_POS (30)
#define SYS_CPU_DEVICE_CLK_ENABLE_AUD_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_WDT_CKEN_POS (31)
#define SYS_CPU_DEVICE_CLK_ENABLE_WDT_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_ADDR (SOC_SYS_REG_BASE + (0xd << 2))

#define SYS_RESERVER_REG0XD_H264_CKEN_POS (0)
#define SYS_RESERVER_REG0XD_H264_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_I2S1_CKEN_POS (1)
#define SYS_RESERVER_REG0XD_I2S1_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_I2S2_CKEN_POS (2)
#define SYS_RESERVER_REG0XD_I2S2_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_YUV_CKEN_POS (3)
#define SYS_RESERVER_REG0XD_YUV_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SLCD_CKEN_POS (4)
#define SYS_RESERVER_REG0XD_SLCD_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_RESERVED_5_31_POS (5)
#define SYS_RESERVER_REG0XD_RESERVED_5_31_MASK (0x7ffffff)

#define SYS_CPU_DEVICE_MEM_CTRL1_ADDR (SOC_SYS_REG_BASE + (0xe << 2))

#define SYS_CPU_DEVICE_MEM_CTRL1_UART1_MEM_SD_POS (0)
#define SYS_CPU_DEVICE_MEM_CTRL1_UART1_MEM_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_UART2_POS (1)
#define SYS_CPU_DEVICE_MEM_CTRL1_UART2_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_SPI1_POS (2)
#define SYS_CPU_DEVICE_MEM_CTRL1_SPI1_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_SDIO_POS (3)
#define SYS_CPU_DEVICE_MEM_CTRL1_SDIO_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_USB_POS (4)
#define SYS_CPU_DEVICE_MEM_CTRL1_USB_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_CAN_POS (5)
#define SYS_CPU_DEVICE_MEM_CTRL1_CAN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_QSPI0_POS (6)
#define SYS_CPU_DEVICE_MEM_CTRL1_QSPI0_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_QSPI1_POS (7)
#define SYS_CPU_DEVICE_MEM_CTRL1_QSPI1_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_PRAM_POS (8)
#define SYS_CPU_DEVICE_MEM_CTRL1_PRAM_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_FFT_POS (9)
#define SYS_CPU_DEVICE_MEM_CTRL1_FFT_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_ABC_POS (10)
#define SYS_CPU_DEVICE_MEM_CTRL1_ABC_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_AUD_POS (11)
#define SYS_CPU_DEVICE_MEM_CTRL1_AUD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_I2S0_POS (12)
#define SYS_CPU_DEVICE_MEM_CTRL1_I2S0_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_I2S1_POS (13)
#define SYS_CPU_DEVICE_MEM_CTRL1_I2S1_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_I2S2_POS (14)
#define SYS_CPU_DEVICE_MEM_CTRL1_I2S2_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_JPGE_POS (15)
#define SYS_CPU_DEVICE_MEM_CTRL1_JPGE_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_YUV_POS (16)
#define SYS_CPU_DEVICE_MEM_CTRL1_YUV_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_JPGD_POS (17)
#define SYS_CPU_DEVICE_MEM_CTRL1_JPGD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_DISP_POS (18)
#define SYS_CPU_DEVICE_MEM_CTRL1_DISP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_DMAD_POS (19)
#define SYS_CPU_DEVICE_MEM_CTRL1_DMAD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_H26F_POS (20)
#define SYS_CPU_DEVICE_MEM_CTRL1_H26F_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_MAC_POS (21)
#define SYS_CPU_DEVICE_MEM_CTRL1_MAC_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_PHY_POS (22)
#define SYS_CPU_DEVICE_MEM_CTRL1_PHY_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_XVR_POS (23)
#define SYS_CPU_DEVICE_MEM_CTRL1_XVR_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_IRDA_POS (24)
#define SYS_CPU_DEVICE_MEM_CTRL1_IRDA_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_LA_POS (25)
#define SYS_CPU_DEVICE_MEM_CTRL1_LA_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_FLSH_POS (26)
#define SYS_CPU_DEVICE_MEM_CTRL1_FLSH_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_UART_POS (27)
#define SYS_CPU_DEVICE_MEM_CTRL1_UART_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_SPI0_POS (28)
#define SYS_CPU_DEVICE_MEM_CTRL1_SPI0_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_ENC_POS (29)
#define SYS_CPU_DEVICE_MEM_CTRL1_ENC_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_DMA0_POS (30)
#define SYS_CPU_DEVICE_MEM_CTRL1_DMA0_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_DMA1_POS (31)
#define SYS_CPU_DEVICE_MEM_CTRL1_DMA1_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_ADDR (SOC_SYS_REG_BASE + (0xf << 2))

#define SYS_CPU_DEVICE_MEM_CTRL2_UART1_MEM_DS_POS (0)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART1_MEM_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_UART2_POS (1)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART2_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_SPI1_POS (2)
#define SYS_CPU_DEVICE_MEM_CTRL2_SPI1_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_SDIO_POS (3)
#define SYS_CPU_DEVICE_MEM_CTRL2_SDIO_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_USB_POS (4)
#define SYS_CPU_DEVICE_MEM_CTRL2_USB_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_CAN_POS (5)
#define SYS_CPU_DEVICE_MEM_CTRL2_CAN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI0_POS (6)
#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI0_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI1_POS (7)
#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI1_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_PRAM_POS (8)
#define SYS_CPU_DEVICE_MEM_CTRL2_PRAM_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_FFT_POS (9)
#define SYS_CPU_DEVICE_MEM_CTRL2_FFT_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_ABC_POS (10)
#define SYS_CPU_DEVICE_MEM_CTRL2_ABC_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_AUD_POS (11)
#define SYS_CPU_DEVICE_MEM_CTRL2_AUD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_I2S0_POS (12)
#define SYS_CPU_DEVICE_MEM_CTRL2_I2S0_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_I2S1_POS (13)
#define SYS_CPU_DEVICE_MEM_CTRL2_I2S1_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_I2S2_POS (14)
#define SYS_CPU_DEVICE_MEM_CTRL2_I2S2_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_JPGE_POS (15)
#define SYS_CPU_DEVICE_MEM_CTRL2_JPGE_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_YUV_POS (16)
#define SYS_CPU_DEVICE_MEM_CTRL2_YUV_MASK (0x1)

