bekencorp/armino/middleware/soc/bk7258/soc/sys_reg.h
#define SYS_CPU_DEVICE_MEM_CTRL2_JPGD_POS (17)
#define SYS_CPU_DEVICE_MEM_CTRL2_JPGD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DISP_POS (18)
#define SYS_CPU_DEVICE_MEM_CTRL2_DISP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DMAD_POS (19)
#define SYS_CPU_DEVICE_MEM_CTRL2_DMAD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_H26F_POS (20)
#define SYS_CPU_DEVICE_MEM_CTRL2_H26F_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_MAC_POS (21)
#define SYS_CPU_DEVICE_MEM_CTRL2_MAC_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_PHY_POS (22)
#define SYS_CPU_DEVICE_MEM_CTRL2_PHY_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_XVR_POS (23)
#define SYS_CPU_DEVICE_MEM_CTRL2_XVR_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_IRDA_POS (24)
#define SYS_CPU_DEVICE_MEM_CTRL2_IRDA_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_LA_POS (25)
#define SYS_CPU_DEVICE_MEM_CTRL2_LA_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_FLSH_POS (26)
#define SYS_CPU_DEVICE_MEM_CTRL2_FLSH_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_UART_POS (27)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_SPI0_POS (28)
#define SYS_CPU_DEVICE_MEM_CTRL2_SPI0_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_ENC_POS (29)
#define SYS_CPU_DEVICE_MEM_CTRL2_ENC_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DMA0_POS (30)
#define SYS_CPU_DEVICE_MEM_CTRL2_DMA0_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DMA1_POS (31)
#define SYS_CPU_DEVICE_MEM_CTRL2_DMA1_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ADDR (SOC_SYS_REG_BASE + (0x10 << 2))

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM1_POS (0)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM1_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM2_POS (1)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM2_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM3_POS (2)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM3_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_ENCP_POS (3)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_ENCP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BAKP_POS (4)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BAKP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_AHBP_POS (5)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_AHBP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_AUDP_POS (6)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_AUDP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_VIDP_POS (7)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_VIDP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BTSP_POS (8)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BTSP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_MAC_POS (9)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_MAC_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_PHY_POS (10)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_PHY_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM0_POS (11)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM0_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM4_POS (12)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM4_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_OFDM_POS (13)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_OFDM_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_TCM0_PGEN_POS (14)
#define SYS_CPU_POWER_SLEEP_WAKEUP_TCM0_PGEN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_PGEN_POS (15)
#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_PGEN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_FLASH_IDLE_POS (16)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_FLASH_IDLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU1_WFI_POS (17)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU1_WFI_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU0_WFI_POS (18)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU0_WFI_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_GLOBAL_POS (19)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_GLOBAL_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_BUS_IDLE_BYPASS_POS (20)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_BUS_IDLE_BYPASS_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_WAKEUP_PLATFORM_EN_POS (21)
#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_WAKEUP_PLATFORM_EN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_SOFT_WAKEUP_REQ_POS (22)
#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_SOFT_WAKEUP_REQ_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_RD_DISABLE_POS (23)
#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_RD_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_OTP_RD_DISABLE_POS (24)
#define SYS_CPU_POWER_SLEEP_WAKEUP_OTP_RD_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_TCM1_PGEN_POS (25)
#define SYS_CPU_POWER_SLEEP_WAKEUP_TCM1_PGEN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_SUBPWDM_EN_POS (26)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_SUBPWDM_EN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU1_SUBPWDM_EN_POS (27)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU1_SUBPWDM_EN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SHARE_MEM_CLKGATING_DISABLE_POS (28)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SHARE_MEM_CLKGATING_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_TICKTIMER_32K_ENABLE_POS (29)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU1_TICKTIMER_32K_ENABLE_POS (30)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU1_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_31_31_POS (31)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_31_31_MASK (0x1)

#define SYS_RESERVER_REG0X11_ADDR (SOC_SYS_REG_BASE + (0x11 << 2))

#define SYS_RESERVER_REG0X11_RESERVED_0_31_POS (0)
#define SYS_RESERVER_REG0X11_RESERVED_0_31_MASK (0xffffffff)

#define SYS_CPU_DEVICE_MEM_CTRL3_ADDR (SOC_SYS_REG_BASE + (0x12 << 2))

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM0_MEM_DS_DEEP_SLEEP_POS (0)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM0_MEM_DS_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM1_DEEP_SLEEP_POS (1)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM1_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM2_DEEP_SLEEP_POS (2)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM2_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM3_DEEP_SLEEP_POS (3)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM3_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM4_DEEP_SLEEP_POS (4)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM4_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ICACHE_ITAG_DEEP_SLEEP_POS (5)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ICACHE_ITAG_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DCACHE_DTAG_DEEP_SLEEP_POS (6)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DCACHE_DTAG_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ICACHE_ITAG_DEEP_SLEEP_POS (7)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ICACHE_ITAG_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DCACHE_DTAG_DEEP_SLEEP_POS (8)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DCACHE_DTAG_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ITCM_DEEP_SLEEP_POS (9)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ITCM_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DTCM_DEEP_SLEEP_POS (10)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DTCM_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ITCM_DEEP_SLEEP_POS (11)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ITCM_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DTCM_DEEP_SLEEP_POS (12)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DTCM_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_ROTT_DEEP_SLEEP_POS (13)
#define SYS_CPU_DEVICE_MEM_CTRL3_ROTT_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RESERVED0_POS (14)
#define SYS_CPU_DEVICE_MEM_CTRL3_RESERVED0_MASK (0x1)

