bekencorp/armino/middleware/soc/bk7258/soc/sys_reg.h
#define SYS_CPU1_INT_32_63_STATUS_CPU1_DMA1_SEC_INT_ST_POS (24)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_DMA1_SEC_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_DMA1_NSEC_INT_ST_POS (25)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_DMA1_NSEC_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_YUVB_INT_ST_POS (26)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_YUVB_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_RESERVED0_POS (27)
#define SYS_CPU1_INT_32_63_STATUS_RESERVED0_MASK (0x1f)

#define SYS_GPIO_CONFIG0_ADDR (SOC_SYS_REG_BASE + (0x30 << 2))

#define SYS_GPIO_CONFIG0_GPIO_CONFIG0_POS (0)
#define SYS_GPIO_CONFIG0_GPIO_CONFIG0_MASK (0xffffffff)

#define SYS_GPIO_CONFIG1_ADDR (SOC_SYS_REG_BASE + (0x31 << 2))

#define SYS_GPIO_CONFIG1_GPIO_CONFIG1_POS (0)
#define SYS_GPIO_CONFIG1_GPIO_CONFIG1_MASK (0xffffffff)

#define SYS_GPIO_CONFIG2_ADDR (SOC_SYS_REG_BASE + (0x32 << 2))

#define SYS_GPIO_CONFIG2_GPIO_CONFIG2_POS (0)
#define SYS_GPIO_CONFIG2_GPIO_CONFIG2_MASK (0xffffffff)

#define SYS_GPIO_CONFIG3_ADDR (SOC_SYS_REG_BASE + (0x33 << 2))

#define SYS_GPIO_CONFIG3_GPIO_CONFIG3_POS (0)
#define SYS_GPIO_CONFIG3_GPIO_CONFIG3_MASK (0xffffffff)

#define SYS_GPIO_CONFIG4_ADDR (SOC_SYS_REG_BASE + (0x34 << 2))

#define SYS_GPIO_CONFIG4_GPIO_CONFIG4_POS (0)
#define SYS_GPIO_CONFIG4_GPIO_CONFIG4_MASK (0xffffffff)

#define SYS_GPIO_CONFIG5_ADDR (SOC_SYS_REG_BASE + (0x35 << 2))

#define SYS_GPIO_CONFIG5_GPIO_CONFIG5_POS (0)
#define SYS_GPIO_CONFIG5_GPIO_CONFIG5_MASK (0xffffffff)

#define SYS_SYS_DEBUG_CONFIG0_ADDR (SOC_SYS_REG_BASE + (0x38 << 2))

#define SYS_SYS_DEBUG_CONFIG0_DBUG_CONFIG0_POS (0)
#define SYS_SYS_DEBUG_CONFIG0_DBUG_CONFIG0_MASK (0xffffffff)

#define SYS_SYS_DEBUG_CONFIG1_ADDR (SOC_SYS_REG_BASE + (0x39 << 2))

#define SYS_SYS_DEBUG_CONFIG1_DBUG_CONFIG1_POS (0)
#define SYS_SYS_DEBUG_CONFIG1_DBUG_CONFIG1_MASK (0xffffffff)

#define SYS_ANA_REG0_ADDR (SOC_SYS_REG_BASE + (0x40 << 2))

#define SYS_ANA_REG0_DPLL_TSTEN_POS (0)
#define SYS_ANA_REG0_DPLL_TSTEN_MASK (0x1)

#define SYS_ANA_REG0_CP_POS (1)
#define SYS_ANA_REG0_CP_MASK (0x7)

#define SYS_ANA_REG0_SPIDETEN_POS (4)
#define SYS_ANA_REG0_SPIDETEN_MASK (0x1)

#define SYS_ANA_REG0_HVREF_POS (5)
#define SYS_ANA_REG0_HVREF_MASK (0x3)

#define SYS_ANA_REG0_LVREF_POS (7)
#define SYS_ANA_REG0_LVREF_MASK (0x3)

#define SYS_ANA_REG0_RZCTRL26M_POS (9)
#define SYS_ANA_REG0_RZCTRL26M_MASK (0x1)

#define SYS_ANA_REG0_LOOPRZCTRL_POS (10)
#define SYS_ANA_REG0_LOOPRZCTRL_MASK (0xf)

#define SYS_ANA_REG0_RPC_POS (14)
#define SYS_ANA_REG0_RPC_MASK (0x3)

#define SYS_ANA_REG0_OPENLOOP_EN_POS (16)
#define SYS_ANA_REG0_OPENLOOP_EN_MASK (0x1)

#define SYS_ANA_REG0_CKSEL_POS (17)
#define SYS_ANA_REG0_CKSEL_MASK (0x3)

#define SYS_ANA_REG0_SPITRIG_POS (19)
#define SYS_ANA_REG0_SPITRIG_MASK (0x1)

#define SYS_ANA_REG0_BAND0_POS (20)
#define SYS_ANA_REG0_BAND0_MASK (0x1)

#define SYS_ANA_REG0_BAND1_POS (21)
#define SYS_ANA_REG0_BAND1_MASK (0x1)

#define SYS_ANA_REG0_BAND_POS (22)
#define SYS_ANA_REG0_BAND_MASK (0x7)

#define SYS_ANA_REG0_BANDMANUAL_POS (25)
#define SYS_ANA_REG0_BANDMANUAL_MASK (0x1)

#define SYS_ANA_REG0_DSPTRIG_POS (26)
#define SYS_ANA_REG0_DSPTRIG_MASK (0x1)

#define SYS_ANA_REG0_LPEN_DPLL_POS (27)
#define SYS_ANA_REG0_LPEN_DPLL_MASK (0x1)

#define SYS_ANA_REG0_NC_28_30_POS (28)
#define SYS_ANA_REG0_NC_28_30_MASK (0x7)

#define SYS_ANA_REG0_VCTRL_DPLLLDO_POS (31)
#define SYS_ANA_REG0_VCTRL_DPLLLDO_MASK (0x1)

#define SYS_ANA_REG1_ADDR (SOC_SYS_REG_BASE + (0x41 << 2))

#define SYS_ANA_REG1_NC3_POS (0)
#define SYS_ANA_REG1_NC3_MASK (0x1)

#define SYS_ANA_REG1_NC2_POS (1)
#define SYS_ANA_REG1_NC2_MASK (0x1)

#define SYS_ANA_REG1_MSW_POS (2)
#define SYS_ANA_REG1_MSW_MASK (0x1ff)

#define SYS_ANA_REG1_ICTRL_POS (11)
#define SYS_ANA_REG1_ICTRL_MASK (0x7)

#define SYS_ANA_REG1_OSC_TRIG_POS (14)
#define SYS_ANA_REG1_OSC_TRIG_MASK (0x1)

#define SYS_ANA_REG1_OSCCAL_TRIG_POS (15)
#define SYS_ANA_REG1_OSCCAL_TRIG_MASK (0x1)

#define SYS_ANA_REG1_CNTI_POS (16)
#define SYS_ANA_REG1_CNTI_MASK (0x1ff)

#define SYS_ANA_REG1_SPI_RST_POS (25)
#define SYS_ANA_REG1_SPI_RST_MASK (0x1)

#define SYS_ANA_REG1_AMSEL_POS (26)
#define SYS_ANA_REG1_AMSEL_MASK (0x1)

#define SYS_ANA_REG1_DIVCTRL_POS (27)
#define SYS_ANA_REG1_DIVCTRL_MASK (0x7)

#define SYS_ANA_REG1_NC1_POS (30)
#define SYS_ANA_REG1_NC1_MASK (0x1)

#define SYS_ANA_REG1_NC0_POS (31)
#define SYS_ANA_REG1_NC0_MASK (0x1)

#define SYS_ANA_REG2_ADDR (SOC_SYS_REG_BASE + (0x42 << 2))

#define SYS_ANA_REG2_XTALH_CTUNE_POS (0)
#define SYS_ANA_REG2_XTALH_CTUNE_MASK (0xff)

#define SYS_ANA_REG2_FORCE_26MPLL_POS (8)
#define SYS_ANA_REG2_FORCE_26MPLL_MASK (0x1)

#define SYS_ANA_REG2_GADC_CMP_ICTRL_POS (9)
#define SYS_ANA_REG2_GADC_CMP_ICTRL_MASK (0x3)

#define SYS_ANA_REG2_GADC_INBUF_ICTRL_POS (11)
#define SYS_ANA_REG2_GADC_INBUF_ICTRL_MASK (0x3)

#define SYS_ANA_REG2_GADC_REFBUF_ICTRL_POS (13)
#define SYS_ANA_REG2_GADC_REFBUF_ICTRL_MASK (0x3)

#define SYS_ANA_REG2_GADC_NOBUF_ENABLE_POS (15)
#define SYS_ANA_REG2_GADC_NOBUF_ENABLE_MASK (0x1)

#define SYS_ANA_REG2_VREF_SCALE_POS (16)
#define SYS_ANA_REG2_VREF_SCALE_MASK (0x1)

#define SYS_ANA_REG2_SCAL_EN_POS (17)
#define SYS_ANA_REG2_SCAL_EN_MASK (0x1)

#define SYS_ANA_REG2_GADC_CAPCAL_EN_POS (18)
#define SYS_ANA_REG2_GADC_CAPCAL_EN_MASK (0x1)

#define SYS_ANA_REG2_GADC_CAPCAL_POS (19)
#define SYS_ANA_REG2_GADC_CAPCAL_MASK (0x3f)

#define SYS_ANA_REG2_SP_NT_CTRL_POS (25)
#define SYS_ANA_REG2_SP_NT_CTRL_MASK (0x7f)

#define SYS_ANA_REG3_ADDR (SOC_SYS_REG_BASE + (0x43 << 2))

#define SYS_ANA_REG3_USBPEN_POS (0)
#define SYS_ANA_REG3_USBPEN_MASK (0xf)

#define SYS_ANA_REG3_USBNEN_POS (4)
#define SYS_ANA_REG3_USBNEN_MASK (0xf)

#define SYS_ANA_REG3_HPSSREN_POS (8)
#define SYS_ANA_REG3_HPSSREN_MASK (0x1)

#define SYS_ANA_REG3_CK_SEL_POS (9)
#define SYS_ANA_REG3_CK_SEL_MASK (0x1)

#define SYS_ANA_REG3_ANABUF_SEL_RX_POS (10)
#define SYS_ANA_REG3_ANABUF_SEL_RX_MASK (0x1)

#define SYS_ANA_REG3_PWD_XTALLDO_POS (11)
#define SYS_ANA_REG3_PWD_XTALLDO_MASK (0x1)

#define SYS_ANA_REG3_IAMP_POS (12)
#define SYS_ANA_REG3_IAMP_MASK (0x1)

