bekencorp/armino/middleware/soc/bk7258/soc/sys_reg.h
#define SYS_ANA_REG3_VDDREN_POS (13)
#define SYS_ANA_REG3_VDDREN_MASK (0x1)

#define SYS_ANA_REG3_XAMP_POS (14)
#define SYS_ANA_REG3_XAMP_MASK (0x3f)

#define SYS_ANA_REG3_VOSEL_POS (20)
#define SYS_ANA_REG3_VOSEL_MASK (0x1f)

#define SYS_ANA_REG3_EN_XTALH_SLEEP_POS (25)
#define SYS_ANA_REG3_EN_XTALH_SLEEP_MASK (0x1)

#define SYS_ANA_REG3_XTAL40_EN_POS (26)
#define SYS_ANA_REG3_XTAL40_EN_MASK (0x1)

#define SYS_ANA_REG3_BUFICTRL_POS (27)
#define SYS_ANA_REG3_BUFICTRL_MASK (0x1)

#define SYS_ANA_REG3_IBIAS_CTRL_POS (28)
#define SYS_ANA_REG3_IBIAS_CTRL_MASK (0x3)

#define SYS_ANA_REG3_ICORE_CTRL_POS (30)
#define SYS_ANA_REG3_ICORE_CTRL_MASK (0x3)

#define SYS_ANA_REG4_ADDR (SOC_SYS_REG_BASE + (0x44 << 2))

#define SYS_ANA_REG4_ANABUF_SEL_TX_POS (0)
#define SYS_ANA_REG4_ANABUF_SEL_TX_MASK (0x1)

#define SYS_ANA_REG4_TRNG_TSTEN_POS (1)
#define SYS_ANA_REG4_TRNG_TSTEN_MASK (0x1)

#define SYS_ANA_REG4_ITUNE_REF_POS (2)
#define SYS_ANA_REG4_ITUNE_REF_MASK (0x7)

#define SYS_ANA_REG4_ITUNE_OPA_POS (5)
#define SYS_ANA_REG4_ITUNE_OPA_MASK (0x7)

#define SYS_ANA_REG4_ITUNE_CMP_POS (8)
#define SYS_ANA_REG4_ITUNE_CMP_MASK (0x7)

#define SYS_ANA_REG4_RNOOISE_SEL_POS (11)
#define SYS_ANA_REG4_RNOOISE_SEL_MASK (0x1)

#define SYS_ANA_REG4_FSLOW_SEL_POS (12)
#define SYS_ANA_REG4_FSLOW_SEL_MASK (0x7)

#define SYS_ANA_REG4_FFAST_SEL_POS (15)
#define SYS_ANA_REG4_FFAST_SEL_MASK (0xf)

#define SYS_ANA_REG4_TRNG_TSTCK_SEL_POS (19)
#define SYS_ANA_REG4_TRNG_TSTCK_SEL_MASK (0x1)

#define SYS_ANA_REG4_CKTST_SEL_POS (20)
#define SYS_ANA_REG4_CKTST_SEL_MASK (0x3)

#define SYS_ANA_REG4_CK_TST_ENBALE_POS (22)
#define SYS_ANA_REG4_CK_TST_ENBALE_MASK (0x1)

#define SYS_ANA_REG4_SW_BIAS_POS (23)
#define SYS_ANA_REG4_SW_BIAS_MASK (0x1)

#define SYS_ANA_REG4_CRB_POS (24)
#define SYS_ANA_REG4_CRB_MASK (0xf)

#define SYS_ANA_REG4_PORT_ENABLEL_POS (28)
#define SYS_ANA_REG4_PORT_ENABLEL_MASK (0xf)

#define SYS_ANA_REG5_ADDR (SOC_SYS_REG_BASE + (0x45 << 2))

#define SYS_ANA_REG5_EN_USB_POS (0)
#define SYS_ANA_REG5_EN_USB_MASK (0x1)

#define SYS_ANA_REG5_EN_XTALL_POS (1)
#define SYS_ANA_REG5_EN_XTALL_MASK (0x1)

#define SYS_ANA_REG5_EN_DCO_POS (2)
#define SYS_ANA_REG5_EN_DCO_MASK (0x1)

#define SYS_ANA_REG5_EN_RAM_POS (3)
#define SYS_ANA_REG5_EN_RAM_MASK (0x1)

#define SYS_ANA_REG5_EN_TEMP_POS (4)
#define SYS_ANA_REG5_EN_TEMP_MASK (0x1)

#define SYS_ANA_REG5_EN_DPLL_POS (5)
#define SYS_ANA_REG5_EN_DPLL_MASK (0x1)

#define SYS_ANA_REG5_EN_CB_POS (6)
#define SYS_ANA_REG5_EN_CB_MASK (0x1)

#define SYS_ANA_REG5_EN_LCD_POS (7)
#define SYS_ANA_REG5_EN_LCD_MASK (0x1)

#define SYS_ANA_REG5_TRXSPI_CTRL_POS (8)
#define SYS_ANA_REG5_TRXSPI_CTRL_MASK (0x3)

#define SYS_ANA_REG5_ADC_DIV_POS (10)
#define SYS_ANA_REG5_ADC_DIV_MASK (0x3)

#define SYS_ANA_REG5_USB_SPEED_POS (12)
#define SYS_ANA_REG5_USB_SPEED_MASK (0x1)

#define SYS_ANA_REG5_SPIDEEPSLEEP_POS (13)
#define SYS_ANA_REG5_SPIDEEPSLEEP_MASK (0x1)

#define SYS_ANA_REG5_VSEL_POS (14)
#define SYS_ANA_REG5_VSEL_MASK (0x1)

#define SYS_ANA_REG5_SWB_POS (15)
#define SYS_ANA_REG5_SWB_MASK (0x1)

#define SYS_ANA_REG5_ITUNE_XTALL_POS (16)
#define SYS_ANA_REG5_ITUNE_XTALL_MASK (0xf)

#define SYS_ANA_REG5_XTALL_TEN_POS (20)
#define SYS_ANA_REG5_XTALL_TEN_MASK (0x1)

#define SYS_ANA_REG5_ROSC_TSTEN_POS (21)
#define SYS_ANA_REG5_ROSC_TSTEN_MASK (0x1)

#define SYS_ANA_REG5_BCAL_START_POS (22)
#define SYS_ANA_REG5_BCAL_START_MASK (0x1)

#define SYS_ANA_REG5_BCAL_EN_POS (23)
#define SYS_ANA_REG5_BCAL_EN_MASK (0x1)

#define SYS_ANA_REG5_BCAL_SEL_POS (24)
#define SYS_ANA_REG5_BCAL_SEL_MASK (0x7)

#define SYS_ANA_REG5_VBIAS_POS (27)
#define SYS_ANA_REG5_VBIAS_MASK (0x1f)

#define SYS_ANA_REG6_ADDR (SOC_SYS_REG_BASE + (0x46 << 2))

#define SYS_ANA_REG6_CALIB_INTERVAL_POS (0)
#define SYS_ANA_REG6_CALIB_INTERVAL_MASK (0x3ff)

#define SYS_ANA_REG6_MODIFY_INTERVAL_POS (10)
#define SYS_ANA_REG6_MODIFY_INTERVAL_MASK (0x3f)

#define SYS_ANA_REG6_XTAL_WAKEUP_TIME_POS (16)
#define SYS_ANA_REG6_XTAL_WAKEUP_TIME_MASK (0xf)

#define SYS_ANA_REG6_SPI_TRIG_POS (20)
#define SYS_ANA_REG6_SPI_TRIG_MASK (0x1)

#define SYS_ANA_REG6_MODIFI_AUTO_POS (21)
#define SYS_ANA_REG6_MODIFI_AUTO_MASK (0x1)

#define SYS_ANA_REG6_CALIB_AUTO_POS (22)
#define SYS_ANA_REG6_CALIB_AUTO_MASK (0x1)

#define SYS_ANA_REG6_CAL_MODE_POS (23)
#define SYS_ANA_REG6_CAL_MODE_MASK (0x1)

#define SYS_ANA_REG6_MANU_ENA_POS (24)
#define SYS_ANA_REG6_MANU_ENA_MASK (0x1)

#define SYS_ANA_REG6_MANU_CIN_POS (25)
#define SYS_ANA_REG6_MANU_CIN_MASK (0x7f)

#define SYS_ANA_REG7_ADDR (SOC_SYS_REG_BASE + (0x47 << 2))

#define SYS_ANA_REG7_PORT_ENABLEL_POS (0)
#define SYS_ANA_REG7_PORT_ENABLEL_MASK (0xffffffff)

#define SYS_ANA_REG8_ADDR (SOC_SYS_REG_BASE + (0x48 << 2))

#define SYS_ANA_REG8_IOLDO_LP_POS (0)
#define SYS_ANA_REG8_IOLDO_LP_MASK (0x1)

#define SYS_ANA_REG8_CORELDO_HP_POS (1)
#define SYS_ANA_REG8_CORELDO_HP_MASK (0x1)

#define SYS_ANA_REG8_DLDOHP_POS (2)
#define SYS_ANA_REG8_DLDOHP_MASK (0x1)

#define SYS_ANA_REG8_T_VANALDOSEL_POS (3)
#define SYS_ANA_REG8_T_VANALDOSEL_MASK (0x7)

#define SYS_ANA_REG8_R_VANALDOSEL_POS (6)
#define SYS_ANA_REG8_R_VANALDOSEL_MASK (0x7)

#define SYS_ANA_REG8_EN_TRSW_POS (9)
#define SYS_ANA_REG8_EN_TRSW_MASK (0x1)

#define SYS_ANA_REG8_ALDOHP_POS (10)
#define SYS_ANA_REG8_ALDOHP_MASK (0x1)

#define SYS_ANA_REG8_ANACURLIM_POS (11)
#define SYS_ANA_REG8_ANACURLIM_MASK (0x1)

#define SYS_ANA_REG8_VIOLDOSEL_POS (12)
#define SYS_ANA_REG8_VIOLDOSEL_MASK (0x7)

#define SYS_ANA_REG8_IOCURLIM_POS (15)
#define SYS_ANA_REG8_IOCURLIM_MASK (0x1)

#define SYS_ANA_REG8_VALOLDOSEL_POS (16)
#define SYS_ANA_REG8_VALOLDOSEL_MASK (0x7)

#define SYS_ANA_REG8_ALOPOWSEL_POS (19)
#define SYS_ANA_REG8_ALOPOWSEL_MASK (0x1)

#define SYS_ANA_REG8_EN_FAST_ALOLDO_POS (20)
#define SYS_ANA_REG8_EN_FAST_ALOLDO_MASK (0x1)

#define SYS_ANA_REG8_ALOLDOHP_POS (21)
#define SYS_ANA_REG8_ALOLDOHP_MASK (0x1)

#define SYS_ANA_REG8_BGCAL_POS (22)
#define SYS_ANA_REG8_BGCAL_MASK (0x3f)

#define SYS_ANA_REG8_VBGCALMODE_POS (28)
#define SYS_ANA_REG8_VBGCALMODE_MASK (0x1)

#define SYS_ANA_REG8_VBGCALSTART_POS (29)
#define SYS_ANA_REG8_VBGCALSTART_MASK (0x1)

#define SYS_ANA_REG8_PWD_BGCAL_POS (30)
#define SYS_ANA_REG8_PWD_BGCAL_MASK (0x1)

