bekencorp/armino/middleware/soc/bk7258/soc/sys_reg.h
#define SYS_ANA_REG8_SPI_ENVBG_POS (31)
#define SYS_ANA_REG8_SPI_ENVBG_MASK (0x1)

#define SYS_ANA_REG9_ADDR (SOC_SYS_REG_BASE + (0x49 << 2))

#define SYS_ANA_REG9_WKGPIOSEL1_POS (0)
#define SYS_ANA_REG9_WKGPIOSEL1_MASK (0xf)

#define SYS_ANA_REG9_RST_WKS1V_POS (4)
#define SYS_ANA_REG9_RST_WKS1V_MASK (0x1)

#define SYS_ANA_REG9_WKGPIOSEL2_POS (5)
#define SYS_ANA_REG9_WKGPIOSEL2_MASK (0xf)

#define SYS_ANA_REG9_SPI_LATCH1V_POS (9)
#define SYS_ANA_REG9_SPI_LATCH1V_MASK (0x1)

#define SYS_ANA_REG9_DIGCURLIM_POS (10)
#define SYS_ANA_REG9_DIGCURLIM_MASK (0x1)

#define SYS_ANA_REG9_PUPRES_ENB1V_POS (11)
#define SYS_ANA_REG9_PUPRES_ENB1V_MASK (0x1)

#define SYS_ANA_REG9_PDNRES_EN1V_POS (12)
#define SYS_ANA_REG9_PDNRES_EN1V_MASK (0x1)

#define SYS_ANA_REG9_D_VEASEL1V_POS (13)
#define SYS_ANA_REG9_D_VEASEL1V_MASK (0x3)

#define SYS_ANA_REG9_ENSFSDD_POS (15)
#define SYS_ANA_REG9_ENSFSDD_MASK (0x1)

#define SYS_ANA_REG9_VCOREHSEL_POS (16)
#define SYS_ANA_REG9_VCOREHSEL_MASK (0xf)

#define SYS_ANA_REG9_VCORELSEL_POS (20)
#define SYS_ANA_REG9_VCORELSEL_MASK (0x7)

#define SYS_ANA_REG9_VLDEN_POS (23)
#define SYS_ANA_REG9_VLDEN_MASK (0x1)

#define SYS_ANA_REG9_EN_FAST_CORELDO_POS (24)
#define SYS_ANA_REG9_EN_FAST_CORELDO_MASK (0x1)

#define SYS_ANA_REG9_PWDCORELDO_POS (25)
#define SYS_ANA_REG9_PWDCORELDO_MASK (0x1)

#define SYS_ANA_REG9_VDIGHSEL_POS (26)
#define SYS_ANA_REG9_VDIGHSEL_MASK (0x7)

#define SYS_ANA_REG9_VDIGSEL_POS (29)
#define SYS_ANA_REG9_VDIGSEL_MASK (0x3)

#define SYS_ANA_REG9_VDD12LDEN_POS (31)
#define SYS_ANA_REG9_VDD12LDEN_MASK (0x1)

#define SYS_ANA_REG10_ADDR (SOC_SYS_REG_BASE + (0x4a << 2))

#define SYS_ANA_REG10_PASOFT_ST_POS (0)
#define SYS_ANA_REG10_PASOFT_ST_MASK (0xf)

#define SYS_ANA_REG10_AZCDCNT_MANU_POS (4)
#define SYS_ANA_REG10_AZCDCNT_MANU_MASK (0x7)

#define SYS_ANA_REG10_TIMER_SEL_POS (7)
#define SYS_ANA_REG10_TIMER_SEL_MASK (0xf)

#define SYS_ANA_REG10_VPABUCKSEL_POS (11)
#define SYS_ANA_REG10_VPABUCKSEL_MASK (0xf)

#define SYS_ANA_REG10_SPI_TIMERWKEN_POS (15)
#define SYS_ANA_REG10_SPI_TIMERWKEN_MASK (0x1)

#define SYS_ANA_REG10_NC_16_16_POS (16)
#define SYS_ANA_REG10_NC_16_16_MASK (0x1)

#define SYS_ANA_REG10_SD_POS (17)
#define SYS_ANA_REG10_SD_MASK (0x1)

#define SYS_ANA_REG10_IOLDOSEL_POS (18)
#define SYS_ANA_REG10_IOLDOSEL_MASK (0x1)

#define SYS_ANA_REG10_IOBYAPSSEN_POS (19)
#define SYS_ANA_REG10_IOBYAPSSEN_MASK (0x1)

#define SYS_ANA_REG10_CKFS_POS (20)
#define SYS_ANA_REG10_CKFS_MASK (0x3)

#define SYS_ANA_REG10_CKINTSEL_POS (22)
#define SYS_ANA_REG10_CKINTSEL_MASK (0x1)

#define SYS_ANA_REG10_OSCCALTRIG_POS (23)
#define SYS_ANA_REG10_OSCCALTRIG_MASK (0x1)

#define SYS_ANA_REG10_MROSCSEL_POS (24)
#define SYS_ANA_REG10_MROSCSEL_MASK (0x1)

#define SYS_ANA_REG10_MROSCI_CAL_POS (25)
#define SYS_ANA_REG10_MROSCI_CAL_MASK (0x7)

#define SYS_ANA_REG10_MROSCCAP_CAL_POS (28)
#define SYS_ANA_REG10_MROSCCAP_CAL_MASK (0xf)

#define SYS_ANA_REG11_ADDR (SOC_SYS_REG_BASE + (0x4b << 2))

#define SYS_ANA_REG11_SFSR_POS (0)
#define SYS_ANA_REG11_SFSR_MASK (0xf)

#define SYS_ANA_REG11_ENSFSAA_POS (4)
#define SYS_ANA_REG11_ENSFSAA_MASK (0x1)

#define SYS_ANA_REG11_APFMS_POS (5)
#define SYS_ANA_REG11_APFMS_MASK (0x1f)

#define SYS_ANA_REG11_ATMPO_SEL_POS (10)
#define SYS_ANA_REG11_ATMPO_SEL_MASK (0x3)

#define SYS_ANA_REG11_AMPOEN_POS (12)
#define SYS_ANA_REG11_AMPOEN_MASK (0x1)

#define SYS_ANA_REG11_ENPOWA_POS (13)
#define SYS_ANA_REG11_ENPOWA_MASK (0x1)

#define SYS_ANA_REG11_AVEA_SEL_POS (14)
#define SYS_ANA_REG11_AVEA_SEL_MASK (0x3)

#define SYS_ANA_REG11_AFORCEPFM_POS (16)
#define SYS_ANA_REG11_AFORCEPFM_MASK (0x1)

#define SYS_ANA_REG11_ACLS_POS (17)
#define SYS_ANA_REG11_ACLS_MASK (0x7)

#define SYS_ANA_REG11_ASWRSTEN_POS (20)
#define SYS_ANA_REG11_ASWRSTEN_MASK (0x1)

#define SYS_ANA_REG11_ARIPC_POS (21)
#define SYS_ANA_REG11_ARIPC_MASK (0x7)

#define SYS_ANA_REG11_ARAMPC_POS (24)
#define SYS_ANA_REG11_ARAMPC_MASK (0xf)

#define SYS_ANA_REG11_ARAMPCEN_POS (28)
#define SYS_ANA_REG11_ARAMPCEN_MASK (0x1)

#define SYS_ANA_REG11_AENBURST_POS (29)
#define SYS_ANA_REG11_AENBURST_MASK (0x1)

#define SYS_ANA_REG11_APFMEN_POS (30)
#define SYS_ANA_REG11_APFMEN_MASK (0x1)

#define SYS_ANA_REG11_ALDOSEL_POS (31)
#define SYS_ANA_REG11_ALDOSEL_MASK (0x1)

#define SYS_ANA_REG12_ADDR (SOC_SYS_REG_BASE + (0x4c << 2))

#define SYS_ANA_REG12_BUCKD_SOFTST_POS (0)
#define SYS_ANA_REG12_BUCKD_SOFTST_MASK (0xf)

#define SYS_ANA_REG12_DZCDCNT_MANU_POS (4)
#define SYS_ANA_REG12_DZCDCNT_MANU_MASK (0x7)

#define SYS_ANA_REG12_CLK_SEL_POS (7)
#define SYS_ANA_REG12_CLK_SEL_MASK (0x1)

#define SYS_ANA_REG12_DPFMS_POS (8)
#define SYS_ANA_REG12_DPFMS_MASK (0x1f)

#define SYS_ANA_REG12_DTMPO_SEL_POS (13)
#define SYS_ANA_REG12_DTMPO_SEL_MASK (0x3)

#define SYS_ANA_REG12_DMPOEN_POS (15)
#define SYS_ANA_REG12_DMPOEN_MASK (0x1)

#define SYS_ANA_REG12_DFORCEPFM_POS (16)
#define SYS_ANA_REG12_DFORCEPFM_MASK (0x1)

#define SYS_ANA_REG12_DCLS_POS (17)
#define SYS_ANA_REG12_DCLS_MASK (0x7)

#define SYS_ANA_REG12_DSWRSTEN_POS (20)
#define SYS_ANA_REG12_DSWRSTEN_MASK (0x1)

#define SYS_ANA_REG12_DRIPC_POS (21)
#define SYS_ANA_REG12_DRIPC_MASK (0x7)

#define SYS_ANA_REG12_DRAMPC_POS (24)
#define SYS_ANA_REG12_DRAMPC_MASK (0xf)

#define SYS_ANA_REG12_DRAMPCEN_POS (28)
#define SYS_ANA_REG12_DRAMPCEN_MASK (0x1)

#define SYS_ANA_REG12_DENBURST_POS (29)
#define SYS_ANA_REG12_DENBURST_MASK (0x1)

#define SYS_ANA_REG12_DPFMEN_POS (30)
#define SYS_ANA_REG12_DPFMEN_MASK (0x1)

#define SYS_ANA_REG12_DLDOSEL_POS (31)
#define SYS_ANA_REG12_DLDOSEL_MASK (0x1)

#define SYS_ANA_REG13_ADDR (SOC_SYS_REG_BASE + (0x4d << 2))

#define SYS_ANA_REG13_PWDOVP1V_POS (0)
#define SYS_ANA_REG13_PWDOVP1V_MASK (0x1)

#define SYS_ANA_REG13_ASOFT_STC_POS (1)
#define SYS_ANA_REG13_ASOFT_STC_MASK (0xf)

#define SYS_ANA_REG13_VOLEN_POS (5)
#define SYS_ANA_REG13_VOLEN_MASK (0x1)

#define SYS_ANA_REG13_DPFMS_POS (6)
#define SYS_ANA_REG13_DPFMS_MASK (0x1f)

#define SYS_ANA_REG13_DTMPO_SEL_POS (11)
#define SYS_ANA_REG13_DTMPO_SEL_MASK (0x3)

#define SYS_ANA_REG13_DMPOEN_POS (13)
#define SYS_ANA_REG13_DMPOEN_MASK (0x1)

