bekencorp/armino/middleware/soc/bk7258/soc/sys_reg.h
#define SYS_ANA_REG13_PAVEA_SEL_POS (14)
#define SYS_ANA_REG13_PAVEA_SEL_MASK (0x3)

#define SYS_ANA_REG13_DFORCEPFM_POS (16)
#define SYS_ANA_REG13_DFORCEPFM_MASK (0x1)

#define SYS_ANA_REG13_DCLS_POS (17)
#define SYS_ANA_REG13_DCLS_MASK (0x7)

#define SYS_ANA_REG13_DSWRSTEN_POS (20)
#define SYS_ANA_REG13_DSWRSTEN_MASK (0x1)

#define SYS_ANA_REG13_DRIPC_POS (21)
#define SYS_ANA_REG13_DRIPC_MASK (0x7)

#define SYS_ANA_REG13_DRAMPC_POS (24)
#define SYS_ANA_REG13_DRAMPC_MASK (0xf)

#define SYS_ANA_REG13_DRAMPCEN_POS (28)
#define SYS_ANA_REG13_DRAMPCEN_MASK (0x1)

#define SYS_ANA_REG13_PAENBURST_POS (29)
#define SYS_ANA_REG13_PAENBURST_MASK (0x1)

#define SYS_ANA_REG13_PAPFMEN_POS (30)
#define SYS_ANA_REG13_PAPFMEN_MASK (0x1)

#define SYS_ANA_REG13_ENBUCKPA_POS (31)
#define SYS_ANA_REG13_ENBUCKPA_MASK (0x1)

#define SYS_ANA_REG14_ADDR (SOC_SYS_REG_BASE + (0x4e << 2))

#define SYS_ANA_REG14_CHS_POS (0)
#define SYS_ANA_REG14_CHS_MASK (0xffff)

#define SYS_ANA_REG14_EN_LPMOD_POS (16)
#define SYS_ANA_REG14_EN_LPMOD_MASK (0x1)

#define SYS_ANA_REG14_CAL_VTH_POS (17)
#define SYS_ANA_REG14_CAL_VTH_MASK (0x7)

#define SYS_ANA_REG14_CRG_POS (20)
#define SYS_ANA_REG14_CRG_MASK (0x3)

#define SYS_ANA_REG14_VREFS_POS (22)
#define SYS_ANA_REG14_VREFS_MASK (0xf)

#define SYS_ANA_REG14_GAIN_S_POS (26)
#define SYS_ANA_REG14_GAIN_S_MASK (0xf)

#define SYS_ANA_REG14_TD_LATCH1V_POS (30)
#define SYS_ANA_REG14_TD_LATCH1V_MASK (0x1)

#define SYS_ANA_REG14_PWD_TD_POS (31)
#define SYS_ANA_REG14_PWD_TD_MASK (0x1)

#define SYS_ANA_REG15_ADDR (SOC_SYS_REG_BASE + (0x4f << 2))

#define SYS_ANA_REG15_CAL_NUMBER1V_POS (0)
#define SYS_ANA_REG15_CAL_NUMBER1V_MASK (0xf)

#define SYS_ANA_REG15_CAL_PERIOD1V_POS (4)
#define SYS_ANA_REG15_CAL_PERIOD1V_MASK (0x1ff)

#define SYS_ANA_REG15_TEST_NUMBER1V_POS (13)
#define SYS_ANA_REG15_TEST_NUMBER1V_MASK (0xf)

#define SYS_ANA_REG15_TEST_PERIOD1V_POS (17)
#define SYS_ANA_REG15_TEST_PERIOD1V_MASK (0xf)

#define SYS_ANA_REG15_NC_21_21_POS (21)
#define SYS_ANA_REG15_NC_21_21_MASK (0x1)

#define SYS_ANA_REG15_CHS_SEL_CAL1V_POS (22)
#define SYS_ANA_REG15_CHS_SEL_CAL1V_MASK (0xf)

#define SYS_ANA_REG15_CAL_DONE_CLR1V_POS (26)
#define SYS_ANA_REG15_CAL_DONE_CLR1V_MASK (0x1)

#define SYS_ANA_REG15_EN_CAL_FORCE1V_POS (27)
#define SYS_ANA_REG15_EN_CAL_FORCE1V_MASK (0x1)

#define SYS_ANA_REG15_EN_CAL_AUTO1V_POS (28)
#define SYS_ANA_REG15_EN_CAL_AUTO1V_MASK (0x1)

#define SYS_ANA_REG15_EN_SCM_POS (29)
#define SYS_ANA_REG15_EN_SCM_MASK (0x1)

#define SYS_ANA_REG15_EN_ADCMOD_POS (30)
#define SYS_ANA_REG15_EN_ADCMOD_MASK (0x1)

#define SYS_ANA_REG15_ENFSR1V_POS (31)
#define SYS_ANA_REG15_ENFSR1V_MASK (0x1)

#define SYS_ANA_REG16_ADDR (SOC_SYS_REG_BASE + (0x50 << 2))

#define SYS_ANA_REG16_INT_EN_POS (0)
#define SYS_ANA_REG16_INT_EN_MASK (0x3ff)

#define SYS_ANA_REG16_INT_EN16_POS (10)
#define SYS_ANA_REG16_INT_EN16_MASK (0x1)

#define SYS_ANA_REG16_NC_11_15_POS (11)
#define SYS_ANA_REG16_NC_11_15_MASK (0x1f)

#define SYS_ANA_REG16_CKADC_SEL_POS (16)
#define SYS_ANA_REG16_CKADC_SEL_MASK (0x1)

#define SYS_ANA_REG16_INT_CLR_SEL1V_POS (17)
#define SYS_ANA_REG16_INT_CLR_SEL1V_MASK (0x1)

#define SYS_ANA_REG16_CTRL_CK2D_POS (18)
#define SYS_ANA_REG16_CTRL_CK2D_MASK (0x1)

#define SYS_ANA_REG16_CTRL_SERI_CAP_POS (19)
#define SYS_ANA_REG16_CTRL_SERI_CAP_MASK (0x1)

#define SYS_ANA_REG16_EN_TESTCMP1V_POS (20)
#define SYS_ANA_REG16_EN_TESTCMP1V_MASK (0x1)

#define SYS_ANA_REG16_EN_MAN_WR1V_POS (21)
#define SYS_ANA_REG16_EN_MAN_WR1V_MASK (0x1)

#define SYS_ANA_REG16_EN_MANMOD1V_POS (22)
#define SYS_ANA_REG16_EN_MANMOD1V_MASK (0x1)

#define SYS_ANA_REG16_CAP_CALSPI1V_POS (23)
#define SYS_ANA_REG16_CAP_CALSPI1V_MASK (0x1ff)

#define SYS_ANA_REG17_ADDR (SOC_SYS_REG_BASE + (0x51 << 2))

#define SYS_ANA_REG17_INT_CLR_POS (0)
#define SYS_ANA_REG17_INT_CLR_MASK (0x3ff)

#define SYS_ANA_REG17_INT_CLR16_POS (10)
#define SYS_ANA_REG17_INT_CLR16_MASK (0x1)

#define SYS_ANA_REG17_NC_11_11_POS (11)
#define SYS_ANA_REG17_NC_11_11_MASK (0x1)

#define SYS_ANA_REG17_INT_CLR_CAL_POS (12)
#define SYS_ANA_REG17_INT_CLR_CAL_MASK (0x3ff)

#define SYS_ANA_REG17_INT_EN_CAL_POS (22)
#define SYS_ANA_REG17_INT_EN_CAL_MASK (0x3ff)

#define SYS_ANA_REG18_ADDR (SOC_SYS_REG_BASE + (0x52 << 2))

#define SYS_ANA_REG18_ISELAUD_POS (0)
#define SYS_ANA_REG18_ISELAUD_MASK (0x1)

#define SYS_ANA_REG18_AUDCK_RLCEN1V_POS (1)
#define SYS_ANA_REG18_AUDCK_RLCEN1V_MASK (0x1)

#define SYS_ANA_REG18_LCHCKINVEN1V_POS (2)
#define SYS_ANA_REG18_LCHCKINVEN1V_MASK (0x1)

#define SYS_ANA_REG18_ENAUDBIAS_POS (3)
#define SYS_ANA_REG18_ENAUDBIAS_MASK (0x1)

#define SYS_ANA_REG18_ENADCBIAS_POS (4)
#define SYS_ANA_REG18_ENADCBIAS_MASK (0x1)

#define SYS_ANA_REG18_ENMICBIAS_POS (5)
#define SYS_ANA_REG18_ENMICBIAS_MASK (0x1)

#define SYS_ANA_REG18_ADCCKINVEN1V_POS (6)
#define SYS_ANA_REG18_ADCCKINVEN1V_MASK (0x1)

#define SYS_ANA_REG18_DACFB2ST0V9_POS (7)
#define SYS_ANA_REG18_DACFB2ST0V9_MASK (0x1)

#define SYS_ANA_REG18_NC1_POS (8)
#define SYS_ANA_REG18_NC1_MASK (0x1)

#define SYS_ANA_REG18_MICBIAS_TRM_POS (9)
#define SYS_ANA_REG18_MICBIAS_TRM_MASK (0x3)

#define SYS_ANA_REG18_MICBIAS_VOC_POS (11)
#define SYS_ANA_REG18_MICBIAS_VOC_MASK (0x1f)

#define SYS_ANA_REG18_VREFSEL1V_POS (16)
#define SYS_ANA_REG18_VREFSEL1V_MASK (0x1)

#define SYS_ANA_REG18_CAPSWSPI_POS (17)
#define SYS_ANA_REG18_CAPSWSPI_MASK (0x1f)

#define SYS_ANA_REG18_ADREF_SEL_POS (22)
#define SYS_ANA_REG18_ADREF_SEL_MASK (0x3)

#define SYS_ANA_REG18_NC0_POS (24)
#define SYS_ANA_REG18_NC0_MASK (0x3)

#define SYS_ANA_REG18_RESERVED_BIT_26_30_POS (26)
#define SYS_ANA_REG18_RESERVED_BIT_26_30_MASK (0x1f)

#define SYS_ANA_REG18_SPI_DACCKPSSEL_POS (31)
#define SYS_ANA_REG18_SPI_DACCKPSSEL_MASK (0x1)

#define SYS_ANA_REG19_ADDR (SOC_SYS_REG_BASE + (0x53 << 2))

#define SYS_ANA_REG19_ISEL_POS (0)
#define SYS_ANA_REG19_ISEL_MASK (0x3)

#define SYS_ANA_REG19_MICIRSEL1_POS (2)
#define SYS_ANA_REG19_MICIRSEL1_MASK (0x1)

#define SYS_ANA_REG19_MICDACIT_POS (3)
#define SYS_ANA_REG19_MICDACIT_MASK (0x3)

#define SYS_ANA_REG19_MICDACIH_POS (5)
#define SYS_ANA_REG19_MICDACIH_MASK (0xff)

#define SYS_ANA_REG19_MICSINGLEEN_POS (13)
#define SYS_ANA_REG19_MICSINGLEEN_MASK (0x1)

#define SYS_ANA_REG19_DCCOMPEN_POS (14)
#define SYS_ANA_REG19_DCCOMPEN_MASK (0x1)

