bekencorp/armino/middleware/soc/bk7258/soc/sys_reg.h
#define SYS_ANA_REG19_MICGAIN_POS (15)
#define SYS_ANA_REG19_MICGAIN_MASK (0xf)

#define SYS_ANA_REG19_MICDACEN_POS (19)
#define SYS_ANA_REG19_MICDACEN_MASK (0x1)

#define SYS_ANA_REG19_STG2LSEN1V_POS (20)
#define SYS_ANA_REG19_STG2LSEN1V_MASK (0x1)

#define SYS_ANA_REG19_OPENLOOPCAL1V_POS (21)
#define SYS_ANA_REG19_OPENLOOPCAL1V_MASK (0x1)

#define SYS_ANA_REG19_CALLATCH_POS (22)
#define SYS_ANA_REG19_CALLATCH_MASK (0x1)

#define SYS_ANA_REG19_VCMSEL_POS (23)
#define SYS_ANA_REG19_VCMSEL_MASK (0x1)

#define SYS_ANA_REG19_DWAMODE_POS (24)
#define SYS_ANA_REG19_DWAMODE_MASK (0x1)

#define SYS_ANA_REG19_R2REN_POS (25)
#define SYS_ANA_REG19_R2REN_MASK (0x1)

#define SYS_ANA_REG19_NC_26_27_POS (26)
#define SYS_ANA_REG19_NC_26_27_MASK (0x3)

#define SYS_ANA_REG19_MICEN_POS (28)
#define SYS_ANA_REG19_MICEN_MASK (0x1)

#define SYS_ANA_REG19_RST_POS (29)
#define SYS_ANA_REG19_RST_MASK (0x1)

#define SYS_ANA_REG19_BPDWA1V_POS (30)
#define SYS_ANA_REG19_BPDWA1V_MASK (0x1)

#define SYS_ANA_REG19_HCEN1STG_POS (31)
#define SYS_ANA_REG19_HCEN1STG_MASK (0x1)

#define SYS_ANA_REG20_ADDR (SOC_SYS_REG_BASE + (0x54 << 2))

#define SYS_ANA_REG20_HPDAC_POS (0)
#define SYS_ANA_REG20_HPDAC_MASK (0x1)

#define SYS_ANA_REG20_CALCON_SEL_POS (1)
#define SYS_ANA_REG20_CALCON_SEL_MASK (0x1)

#define SYS_ANA_REG20_OSCDAC_POS (2)
#define SYS_ANA_REG20_OSCDAC_MASK (0x3)

#define SYS_ANA_REG20_OCENDAC_POS (4)
#define SYS_ANA_REG20_OCENDAC_MASK (0x1)

#define SYS_ANA_REG20_VCMSEL_POS (5)
#define SYS_ANA_REG20_VCMSEL_MASK (0x1)

#define SYS_ANA_REG20_ADJDACREF_POS (6)
#define SYS_ANA_REG20_ADJDACREF_MASK (0x1f)

#define SYS_ANA_REG20_DCOCHG_POS (11)
#define SYS_ANA_REG20_DCOCHG_MASK (0x3)

#define SYS_ANA_REG20_DIFFEN_POS (13)
#define SYS_ANA_REG20_DIFFEN_MASK (0x1)

#define SYS_ANA_REG20_ENDACCAL_POS (14)
#define SYS_ANA_REG20_ENDACCAL_MASK (0x1)

#define SYS_ANA_REG20_NC2_POS (15)
#define SYS_ANA_REG20_NC2_MASK (0x1)

#define SYS_ANA_REG20_LENDCOC_POS (16)
#define SYS_ANA_REG20_LENDCOC_MASK (0x1)

#define SYS_ANA_REG20_NC1_POS (17)
#define SYS_ANA_REG20_NC1_MASK (0x1)

#define SYS_ANA_REG20_LENVCMD_POS (18)
#define SYS_ANA_REG20_LENVCMD_MASK (0x1)

#define SYS_ANA_REG20_DACDRVEN_POS (19)
#define SYS_ANA_REG20_DACDRVEN_MASK (0x1)

#define SYS_ANA_REG20_NC0_POS (20)
#define SYS_ANA_REG20_NC0_MASK (0x1)

#define SYS_ANA_REG20_DACLEN_POS (21)
#define SYS_ANA_REG20_DACLEN_MASK (0x1)

#define SYS_ANA_REG20_DACG_POS (22)
#define SYS_ANA_REG20_DACG_MASK (0xf)

#define SYS_ANA_REG20_DACMUTE_POS (26)
#define SYS_ANA_REG20_DACMUTE_MASK (0x1)

#define SYS_ANA_REG20_DACDWAMODE_SEL_POS (27)
#define SYS_ANA_REG20_DACDWAMODE_SEL_MASK (0x1)

#define SYS_ANA_REG20_DACSEL_POS (28)
#define SYS_ANA_REG20_DACSEL_MASK (0xf)

#define SYS_ANA_REG21_ADDR (SOC_SYS_REG_BASE + (0x55 << 2))

#define SYS_ANA_REG21_LMDCIN_POS (0)
#define SYS_ANA_REG21_LMDCIN_MASK (0xff)

#define SYS_ANA_REG21_NC1_POS (8)
#define SYS_ANA_REG21_NC1_MASK (0xff)

#define SYS_ANA_REG21_SPIRST_OVC_POS (16)
#define SYS_ANA_REG21_SPIRST_OVC_MASK (0x1)

#define SYS_ANA_REG21_NC0_POS (17)
#define SYS_ANA_REG21_NC0_MASK (0x1)

#define SYS_ANA_REG21_ENIDACL_POS (18)
#define SYS_ANA_REG21_ENIDACL_MASK (0x1)

#define SYS_ANA_REG21_DAC3RDHC0V9_POS (19)
#define SYS_ANA_REG21_DAC3RDHC0V9_MASK (0x1)

#define SYS_ANA_REG21_HC2S_POS (20)
#define SYS_ANA_REG21_HC2S_MASK (0x1)

#define SYS_ANA_REG21_RFB_CTRL_POS (21)
#define SYS_ANA_REG21_RFB_CTRL_MASK (0x1)

#define SYS_ANA_REG21_VCMSEL_POS (22)
#define SYS_ANA_REG21_VCMSEL_MASK (0x1)

#define SYS_ANA_REG21_ENBS_POS (23)
#define SYS_ANA_REG21_ENBS_MASK (0x1)

#define SYS_ANA_REG21_CALCK_SEL0V9_POS (24)
#define SYS_ANA_REG21_CALCK_SEL0V9_MASK (0x1)

#define SYS_ANA_REG21_BPDWA0V9_POS (25)
#define SYS_ANA_REG21_BPDWA0V9_MASK (0x1)

#define SYS_ANA_REG21_LOOPRST0V9_POS (26)
#define SYS_ANA_REG21_LOOPRST0V9_MASK (0x1)

#define SYS_ANA_REG21_OCT0V9_POS (27)
#define SYS_ANA_REG21_OCT0V9_MASK (0x3)

#define SYS_ANA_REG21_SOUT0V9_POS (29)
#define SYS_ANA_REG21_SOUT0V9_MASK (0x1)

#define SYS_ANA_REG21_HC0V9_POS (30)
#define SYS_ANA_REG21_HC0V9_MASK (0x3)

#define SYS_ANA_REG22_ADDR (SOC_SYS_REG_BASE + (0x56 << 2))

#define SYS_ANA_REG22_ICTRL_DSPPLL_POS (0)
#define SYS_ANA_REG22_ICTRL_DSPPLL_MASK (0xf)

#define SYS_ANA_REG22_NC_4_18_POS (4)
#define SYS_ANA_REG22_NC_4_18_MASK (0x7fff)

#define SYS_ANA_REG22_MODE_POS (19)
#define SYS_ANA_REG22_MODE_MASK (0x1)

#define SYS_ANA_REG22_IAMSEL_POS (20)
#define SYS_ANA_REG22_IAMSEL_MASK (0x1)

#define SYS_ANA_REG22_HVREF_POS (21)
#define SYS_ANA_REG22_HVREF_MASK (0x3)

#define SYS_ANA_REG22_LVREF_POS (23)
#define SYS_ANA_REG22_LVREF_MASK (0x3)

#define SYS_ANA_REG22_NC_25_31_POS (25)
#define SYS_ANA_REG22_NC_25_31_MASK (0x7f)

#define SYS_ANA_REG23_ADDR (SOC_SYS_REG_BASE + (0x57 << 2))

#define SYS_ANA_REG23_CAMSEL_POS (0)
#define SYS_ANA_REG23_CAMSEL_MASK (0x1)

#define SYS_ANA_REG23_MSW_POS (1)
#define SYS_ANA_REG23_MSW_MASK (0x1ff)

#define SYS_ANA_REG23_TSTCKEN_DPLL_POS (10)
#define SYS_ANA_REG23_TSTCKEN_DPLL_MASK (0x1)

#define SYS_ANA_REG23_OSCCAL_TRIG_POS (11)
#define SYS_ANA_REG23_OSCCAL_TRIG_MASK (0x1)

#define SYS_ANA_REG23_CNTI_POS (12)
#define SYS_ANA_REG23_CNTI_MASK (0x1ff)

#define SYS_ANA_REG23_NC_21_21_POS (21)
#define SYS_ANA_REG23_NC_21_21_MASK (0x1)

#define SYS_ANA_REG23_SPI_RST_POS (22)
#define SYS_ANA_REG23_SPI_RST_MASK (0x1)

#define SYS_ANA_REG23_CLOSELOOP_EN_POS (23)
#define SYS_ANA_REG23_CLOSELOOP_EN_MASK (0x1)

#define SYS_ANA_REG23_CALTIME_POS (24)
#define SYS_ANA_REG23_CALTIME_MASK (0x1)

#define SYS_ANA_REG23_LPFRZ_POS (25)
#define SYS_ANA_REG23_LPFRZ_MASK (0x3)

#define SYS_ANA_REG23_ICP_POS (27)
#define SYS_ANA_REG23_ICP_MASK (0xf)

#define SYS_ANA_REG23_CP2CTRL_POS (31)
#define SYS_ANA_REG23_CP2CTRL_MASK (0x1)

#ifdef __cplusplus
}
#endif
